#### Group Aggregation

![group aggregation](./pics/group%20aggregation.png)

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                  'key2': ['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})

df

      data1     data2 key1 key2
0 -1.567224 -0.170924    a  one
1 -0.667752  0.252238    a  two
2 -0.043368 -0.419071    b  one
3  0.178115  0.735708    b  two
4  0.782221  0.276604    a  one

- A list or array of values that is the same length as the axis being grouped

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a   -0.484252
b    0.067373
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [6]:
means

key1  key2
a     one    -0.392501
      two    -0.667752
b     one    -0.043368
      two     0.178115
Name: data1, dtype: float64

In [7]:
means['a']

key2
one   -0.392501
two   -0.667752
Name: data1, dtype: float64

In [8]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [9]:
df['data1'].groupby([states, years]).mean()

California  2005   -0.667752
            2006   -0.043368
Ohio        2005   -0.694555
            2006    0.782221
Name: data1, dtype: float64

- A value indicating a column name in a DataFrame

In [10]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.484252  0.119306
b     0.067373  0.158319

In [11]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.392501  0.052840
     two  -0.667752  0.252238
b    one  -0.043368 -0.419071
     two   0.178115  0.735708

In [12]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

#### Any missing values in a group key will be excluded from the result

In [13]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -1.567224 -0.170924    a  one
1 -0.667752  0.252238    a  two
4  0.782221  0.276604    a  one
b
      data1     data2 key1 key2
2 -0.043368 -0.419071    b  one
3  0.178115  0.735708    b  two

#### Iterating Over Groups

In [14]:
for k, group in df.groupby(['key1', 'key2']):
    print(k)
    print(group)

('a', 'one')
      data1     data2 key1 key2
0 -1.567224 -0.170924    a  one
4  0.782221  0.276604    a  one
('a', 'two')
      data1     data2 key1 key2
1 -0.667752  0.252238    a  two
('b', 'one')
      data1     data2 key1 key2
2 -0.043368 -0.419071    b  one
('b', 'two')
      data1     data2 key1 key2
3  0.178115  0.735708    b  two

In [15]:
list(df.groupby('key1'))

[('a',       data1     data2 key1 key2
  0 -1.567224 -0.170924    a  one
  1 -0.667752  0.252238    a  two
  4  0.782221  0.276604    a  one), ('b',       data1     data2 key1 key2
  2 -0.043368 -0.419071    b  one
  3  0.178115  0.735708    b  two)]

In [16]:
pieces = dict(list(df.groupby('key1')))

In [17]:
pieces

{'a':       data1     data2 key1 key2
 0 -1.567224 -0.170924    a  one
 1 -0.667752  0.252238    a  two
 4  0.782221  0.276604    a  one, 'b':       data1     data2 key1 key2
 2 -0.043368 -0.419071    b  one
 3  0.178115  0.735708    b  two}

In [18]:
pieces['b']

      data1     data2 key1 key2
2 -0.043368 -0.419071    b  one
3  0.178115  0.735708    b  two

In [19]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [20]:
grouped = df.groupby(df.dtypes, axis=1)

for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -1.567224 -0.170924
1 -0.667752  0.252238
2 -0.043368 -0.419071
3  0.178115  0.735708
4  0.782221  0.276604
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

#### Selecting a Column or Subset of Columns
```
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]
```
syntactic sugar for:
```
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])
```

In [21]:
df.groupby('key1')['data1']

In [22]:
df.groupby('key1')[['data2']]

In [23]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.052840
     two   0.252238
b    one  -0.419071
     two   0.735708

- A dict or Series giving a correspondence between the values on the axis being
grouped and the group names

In [24]:
people = pd.DataFrame(np.random.randn(5, 5),
                     columns=['a', 'b', 'c', 'd', 'e'],
                     index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

people.iloc[2:3, [1, 2]] = np.nan
people

               a         b         c         d         e
Joe     0.315066  1.351442  0.194082 -0.347523 -1.299684
Steve   0.520069 -0.314291 -0.797788 -1.147744  0.180422
Wes     1.145661       NaN       NaN  0.018566  1.365330
Jim     0.378535 -0.080562 -0.265390 -0.426876  0.320438
Travis -0.358810 -0.684944 -1.310978 -0.424925 -0.537119

In [25]:
mapping = {'a':'red', 'b': 'red', 'c': 'blue',
          'd': 'blue', 'e': 'red', 'f': 'orange'}

In [26]:
by_column = people.groupby(mapping, axis=1)
by_column.size()

blue    2
red     3
dtype: int64

In [27]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [28]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

- A function to be invoked on the axis index or the individual labels in the index

In [29]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.839261  1.270879 -0.071308 -0.755833  0.386084
5  0.520069 -0.314291 -0.797788 -1.147744  0.180422
6 -0.358810 -0.684944 -1.310978 -0.424925 -0.537119

In [30]:
key_list = ['one', 'one', 'one', 'two', 'two']

people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.315066  1.351442  0.194082 -0.347523 -1.299684
  two  0.378535 -0.080562 -0.265390 -0.426876  0.320438
5 one  0.520069 -0.314291 -0.797788 -1.147744  0.180422
6 two -0.358810 -0.684944 -1.310978 -0.424925 -0.537119

In [31]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                   names=['cty', 'tenor'])
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [32]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.234869 -1.166585 -0.054520 -1.065636 -0.028945
1      1.779654  1.288528  0.845651 -0.031635  0.283478
2     -0.527903  0.571154  0.490280  1.339096 -0.398379
3     -1.473882 -0.102191 -0.356960  0.430746  1.717233

In [33]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

####  std, var --- Unbiased (n – 1 denominator) standard deviation and variance

In [34]:
df

      data1     data2 key1 key2
0 -1.567224 -0.170924    a  one
1 -0.667752  0.252238    a  two
2 -0.043368 -0.419071    b  one
3  0.178115  0.735708    b  two
4  0.782221  0.276604    a  one

In [35]:
grouped = df.groupby('key1')

In [36]:
for name, group in grouped:
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -1.567224 -0.170924    a  one
1 -0.667752  0.252238    a  two
4  0.782221  0.276604    a  one
b
      data1     data2 key1 key2
2 -0.043368 -0.419071    b  one
3  0.178115  0.735708    b  two

In [37]:
grouped['data1'].quantile(0.5) # 分位点

key1
a   -0.667752
b    0.067373
Name: data1, dtype: float64

In [38]:
def  peak_to_peak(arr):
    return arr.max() - arr.min()

In [39]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.349445  0.447529
b     0.221483  1.154780

In [40]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.484252  1.185423 -1.567224 -1.117488 -0.667752  0.057234
b      2.0  0.067373  0.156612 -0.043368  0.012003  0.067373  0.122744

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.782221   3.0  0.119306  0.251642 -0.170924  0.040657  0.252238
b     0.178115   2.0  0.158319  0.816552 -0.419071 -0.130376  0.158319


           75%       max
key1
a     0.264421  0.276604
b     0.447014  0.735708

In [41]:
tips = pd.read_csv('examples/tips.csv')

In [42]:
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [43]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [44]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [45]:
grouped = tips.groupby(['day', 'smoker'])

In [46]:
grouped_pct = grouped['tip_pct']
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

#### Aggregate using multiple functions at once

In [47]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

> (name, function)
>
> the first element of each tuple will be used as the DataFrame column names

In [48]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [49]:
functions = ['count', 'mean', 'max']

In [50]:
result = grouped['tip_pct', 'total_bill'].agg(functions)

In [51]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [52]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [53]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [54]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

> Different functions to one or more of the columns

In [55]:
grouped.agg({'tip': np.max, 'size': 'sum'})

             size    tip
day  smoker
Fri  No         9   3.50
     Yes       31   4.73
Sat  No       115   9.00
     Yes      104  10.00
Sun  No       167   6.00
     Yes       49   6.50
Thur No       112   6.70
     Yes       40   5.00

In [56]:
grouped.max()

             total_bill    tip    time  size   tip_pct
day  smoker
Fri  No           22.75   3.50   Lunch     3  0.187735
     Yes          40.17   4.73   Lunch     4  0.263480
Sat  No           48.33   9.00  Dinner     4  0.291990
     Yes          50.81  10.00  Dinner     5  0.325733
Sun  No           48.17   6.00  Dinner     6  0.252672
     Yes          45.35   6.50  Dinner     5  0.710345
Thur No           41.19   6.70   Lunch     6  0.266312
     Yes          43.11   5.00   Lunch     4  0.241255

> A DataFrame will have hierarchical columns only if multiple functions are applied to at least one column

In [57]:
grouped.agg({'tip_pct': ['min', 'max', 'mean', 'std'], 'size': 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

#### Returning Aggregated Data Without Row Indexes

In [58]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [59]:
result = tips.groupby(['day', 'smoker']).mean()

In [60]:
result

             total_bill       tip      size   tip_pct
day  smoker
Fri  No       18.420000  2.812500  2.250000  0.151650
     Yes      16.813333  2.714000  2.066667  0.174783
Sat  No       19.661778  3.102889  2.555556  0.158048
     Yes      21.276667  2.875476  2.476190  0.147906
Sun  No       20.506667  3.167895  2.929825  0.160113
     Yes      24.120000  3.516842  2.578947  0.187250
Thur No       17.113111  2.673778  2.488889  0.160298
     Yes      19.190588  3.030000  2.352941  0.163863

In [61]:
result.reset_index()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863